In [1]:
import pandas as pd

# Variables

In [10]:
x = 5
y = 4
xy = 'hello world of Data'

In [13]:
print x + y, xy

9 hello world of Data

Arithmetic Operators

In [14]:
5 + 6

11

In [15]:
8 - 4

4

In [16]:
1 / 2

0

In [17]:
1.0 / 2

0.5

In [18]:
28 % 8

4

In [21]:
24 % 8

0

In [22]:
24.4 // 2.0

12.0

In [24]:
4 ** 4

256

In [25]:
2 ** 5

32

In [26]:
z = 10

In [27]:
z == y

False

In [28]:
z == 10

True

In [29]:
z != 7

True

In [30]:
z <= 10

True

In [31]:
z >= 10

True

In [32]:
z >= 9

True

In [35]:
print int(9.8)

9

In [36]:
print str(9.8)

9.8

In [37]:
print float(98)

98.0

In [38]:
print chr(100)

d

In [39]:
print ord ('d')

100

In [40]:
print round (3.0987,3)

3.099

In [41]:
print round (3.0987)

3.0

In [42]:
print round (3.98987)

4.0

In [44]:
d = complex ('8+3j')
print abs (d)

8.54400374532

In [45]:
print isinstance ('1', int)

False

In [46]:
print isinstance (10,int)

True

In [47]:
print isinstance (9.8, float)

True

# cmp 
cmp (x, y)
negative number if x is less than y
positive value is x is greater than y
zero if x is equal to y

In [52]:
print cmp (8,5)
print cmp (5,6)
print cmp (8,8)
print cmp (10,5)

1
-1
0
1

In [55]:
print pow (4,4)
print pow (2,5)

256
32

In [56]:
print pow (2,5,5)
print 32 % 5

2
2

In [57]:
print range (5)

[0, 1, 2, 3, 4]

In [61]:
print range (4,12)
print range (2,4,12)
print range (2,27,8)

[4, 5, 6, 7, 8, 9, 10, 11]
[2]
[2, 10, 18, 26]

In [62]:
print ('hello world')

hello world

In [63]:
print ("""hey, my name is Fidelia, 
I am beginning to have fun with this""")

hey, my name is Fidelia,
I am beginning to have fun with this

In [90]:
string1 = 'hello'
string2 = '!'
print string1, 'world', string2
print string1 + "world" + string2

hello world !
helloworld!

In [77]:
print '%s world'% string1

hello world

In [96]:
print 'actual number = %d'%50
print 'exponential equivalent of the number=%e'%50
print '%s world %s'%(string1, string2)

actual number = 50
exponential equivalent of the number=5.000000e+01
hello world !

In [98]:
print 'F'*15

FFFFFFFFFFFFFFF

In [101]:
print 'Mon\nTue\nWed\nThu\nFri\nSat\nSun'

Mon
Tue
Wed
Thu
Fri
Sat
Sun

In [107]:
print """
Routine:
\t-wake up
\t-pray
\t-shower
\t-eat
\t-work
\t-pray
\t-sleep\n\t-repeat
"""

Routine:
	-wake up
	-pray
	-shower
	-eat
	-work
	-pray
	-sleep
	-repeat

# Data Structures

In [126]:
x = ['orange', 'apple', 'kiwi', 'banana', 'mango']
y = ['grape', 'blueberries']
z = (x,y)
z1 = z[0]
z2 = z[1]

In [111]:
print (x[4])

mango

In [115]:
x[4]
x[0]

'orange'

In [117]:
x [2]

'kiwi'

In [118]:
x[-3]

'kiwi'

In [121]:
print z

(['orange', 'apple', 'kiwi', 'banana', 'mango'], ['grape', 'blueberries'])

In [122]:
print z[0]

['orange', 'apple', 'kiwi', 'banana', 'mango']

In [127]:
print (z1,z2)

(['orange', 'apple', 'kiwi', 'banana', 'mango'], ['grape', 'blueberries'])

In [128]:
print z1[3]

banana

In [132]:
z1 = z [0]
print z1 == x

True

In [136]:
z [0][0]

'orange'

Slicing

In [144]:
num = [0,1,2,3,4,5,6,7,8,9,10]

In [145]:
print num [0]

0

In [146]:
print num[9:]

[9, 10]

In [147]:
print num[0:7]

[0, 1, 2, 3, 4, 5, 6]

In [148]:
print num [:9]

[0, 1, 2, 3, 4, 5, 6, 7, 8]

In [152]:
print num [:8:3]

[0, 3, 6]

In [202]:
print num [-1]

10

In [153]:
print len (num)

11

In [154]:
print min (num)

0

In [156]:
print max (num)

10

In [157]:
print [1,2,3,4] + [5,6,7,8,9,10]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [175]:
canada = ['Ontario', 'Manitoba', 'Mewfoundland', 'Alberta', 'NovaScotia']

In [162]:
'Newyork' in canada

False

In [176]:
"Ontario" in canada

True

In [177]:
'Manitoba' in canada

True

In [178]:
print max (canada, key = len)

Mewfoundland

In [179]:
print min (canada, key = len)

Ontario

In [187]:
lst = [1,2,2,4,6,8,9]

In [182]:
print lst.count (2)

2

In [197]:
lst1 =[4,4,4,4,4]

In [200]:
lst.append(lst1)
print lst

[1, 2, 2, 4, 6, 8, 9, [4, 4, 5, 6, 9], [4, 4, 5, 6, 9], [4, 4, 5, 6, 9], 4, 4, 5, 6, 9, 4, 4, 5, 6, 9, 4, 4, 5, 6, 9, [4, 4, 4, 4, 4], [4, 4, 4, 4, 4], [4, 4, 4, 4, 4]]

# why did the append function print multiples?

In [204]:
list("happy")

['h', 'a', 'p', 'p', 'y']

In [207]:
lst =[1,2,3,4,5,6,7,7,7]

In [208]:
lst.append (9)
print lst

[1, 2, 3, 4, 5, 6, 7, 7, 7, 9]

In [210]:
lst.extend(lst)
print lst

[1, 2, 3, 4, 5, 6, 7, 7, 7, 9, 1, 2, 3, 4, 5, 6, 7, 7, 7, 9, 1, 2, 3, 4, 5, 6, 7, 7, 7, 9, 1, 2, 3, 4, 5, 6, 7, 7, 7, 9]

In [211]:
lst1 = [1,2,3]

In [213]:
lst.append(lst1)
print lst

[1, 2, 3, 4, 5, 6, 7, 7, 7, 9, 1, 2, 3, 4, 5, 6, 7, 7, 7, 9, 1, 2, 3, 4, 5, 6, 7, 7, 7, 9, 1, 2, 3, 4, 5, 6, 7, 7, 7, 9, [1, 2, 3], [1, 2, 3]]

In [214]:
lst.index(5)

4

In [215]:
lst.pop()

[1, 2, 3]

In [216]:
lst1.pop ()

3

In [217]:
lst1.pop (1)

2

In [219]:
lst1.insert(2,'good')
print lst1

[1, 'good', 'good']

In [220]:
lst1.remove ("good")

In [221]:
print lst1

[1, 'good']

In [222]:
lst1.insert(1,1)

In [223]:
print lst1

[1, 1, 'good']

In [224]:
lst1.reverse()

In [225]:
print lst1

['good', 1, 1]

In [226]:
lst1.sort()

In [227]:
print lst1

[1, 1, 'good']

In [228]:
lst1.sort(reverse=True)

In [229]:
print lst1

['good', 1, 1]

In [230]:
canada.sort()

In [231]:
print canada

['Alberta', 'Manitoba', 'Mewfoundland', 'NovaScotia', 'Ontario']

In [232]:
canada.sort(reverse=True)
print canada

['Ontario', 'NovaScotia', 'Mewfoundland', 'Manitoba', 'Alberta']

copying a list

In [233]:
lista = [5,4,3,2,1]

In [234]:
listb = lista
print listb

[5, 4, 3, 2, 1]

In [235]:
lista.pop()
print lista
lista.append(6)
print lista

[5, 4, 3, 2]
[5, 4, 3, 2, 6]

In [236]:
print listb

[5, 4, 3, 2, 6]

In [237]:
lista = [5,4,3,2,1]

In [238]:
listb = lista[:]
print listb

[5, 4, 3, 2, 1]

In [239]:
lista.pop()
print lista
lista.append (6)
print lista

[5, 4, 3, 2]
[5, 4, 3, 2, 6]

In [240]:
print listb

[5, 4, 3, 2, 1]

##Tupples

In [241]:
xyz = divmod (25,4)
print (xyz)
print type (xyz)

(6, 1)
<type 'tuple'>

25/4 = 6 R 1

In [243]:
30,

(30,)

In [244]:
30*2
(30,)*2

(30, 30)

In [245]:
a = 30 * 2
b = (30,)*2
print a
print b

60
(30, 30)

In [246]:
tup3 = tuple ([9,8,7,6])
print tup3
tup4 = tuple ('happy')
print tup4

(9, 8, 7, 6)
('h', 'a', 'p', 'p', 'y')

In [248]:
print tup3 [2]
tup5 = tup4 [ :3]
print tup5

7
('h', 'a', 'p')

mapping tuples

In [249]:
(a, b, c) = ('alpha', 'betta', 'gamma')
print a,b,c

alpha betta gamma

In [250]:
d = tuple ('FideliaOgoh')
print d

('F', 'i', 'd', 'e', 'l', 'i', 'a', 'O', 'g', 'o', 'h')

Built in tuple functions

In [251]:
d.count ("o")

1

In [252]:
d.count ('i')

2

In [253]:
d.index ('h')

10

##sets

In [254]:
set1 = set()
print type (set1)
print (set1)

<type 'set'>
set([])

In [255]:
set0 = set ([1,1,2,2,3,4,5,6,6])
print set0

set([1, 2, 3, 4, 5, 6])

Built in set functions

In [256]:
set2 = set([4,5,6,7,8])

In [258]:
set3 = set([1,2,3,6,7,8,9,10])

In [259]:
set2.union(set3)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [260]:
set3.add(0)
set3

{0, 1, 2, 3, 6, 7, 8, 9, 10}

In [261]:
set3.add(4)
set3

{0, 1, 2, 3, 4, 6, 7, 8, 9, 10}

In [262]:
set2.intersection(set3)

{4, 6, 7, 8}

In [263]:
set2.difference (set3)

{5}

In [264]:
set2.symmetric_difference (set3)

{0, 1, 2, 3, 5, 9, 10}

In [266]:
set2.issubset(set3)
set3.isdisjoint(set2)
set3.issuperset(set2)

False

In [267]:
set2.pop()
print set2

set([4, 5, 6, 7])

In [268]:
set2.remove(5)

In [269]:
print set2

set([4, 6, 7])

In [270]:
set2.clear()
print set2

set([])

# Control Flow Statements; 
if condition:
   code

In [272]:
num1 = 100
num2 = 50

In [273]:
if num1 > num2:
    print ("num1 is bigger than num2")

num1 is bigger than num2

In [278]:
x = 15
if x > 12:
   if x == 15:
      print ("way to go!")

way to go!

In [279]:
x = 13
if x > 12:
    if x == 15:
        print ("way to go!")
    else:
        print ("no way!")

no way!

In [280]:
x = 15
y = 20
if x > y:
    print 'x > y'
elif x < y:
    print 'x < y'
else:
    print 'x = y'

x < y

In [282]:
x = 15
y = 20
if x > y:
    print 'x > y'
elif x < y:
    print 'x < y'
    if x == 15:
       print 'x = 15'
    else:
        print 'invalid'
else:
    print 'x = y'

x < y
x = 15

Loops

In [283]:
for i in range (10):
    print i

0
1
2
3
4
5
6
7
8
9

In [284]:
list_of_lists = [1,2,3], [4,5,6], [7,8,9]
for list1 in list_of_lists:
    print list1

[1, 2, 3]
[4, 5, 6]
[7, 8, 9]

In [285]:
list_of_lists = [[1,2,3], [4,5,6], [7,8,9]]
for list1 in list_of_lists:
    for x in list1:
        print x

1
2
3
4
5
6
7
8
9

In [286]:
i = 5
while i < 6:
    print (i**2)
    i = i + 3
    print ('thanks')

25
thanks

In [289]:
for i in range (50):
    print i
    if i >= 10:
         break

0
1
2
3
4
5
6
7
8
9
10

In [290]:
for i in range (50):
    if i > 10:
        print "The end."
        continue
    elif i < 20:
        print i

0
1
2
3
4
5
6
7
8
9
10
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.
The end.

In [293]:
res = []
for i in range (1,20):
    x = 15 * i
    res.append(x)
print res

[15, 30, 45, 60, 75, 90, 105, 120, 135, 150, 165, 180, 195, 210, 225, 240, 255, 270, 285]

In [295]:

[15 * x for x in range (1,20)]

[15,
 30,
 45,
 60,
 75,
 90,
 105,
 120,
 135,
 150,
 165,
 180,
 195,
 210,
 225,
 240,
 255,
 270,
 285]

In [296]:
[15 * x for x in range (1,20) if x<=15]

[15, 30, 45, 60, 75, 90, 105, 120, 135, 150, 165, 180, 195, 210, 225]

In [298]:
[15 * z for i in range (60) if i == 15 for z in range (1, 10)]

[15, 30, 45, 60, 75, 90, 105, 120, 135]

# PANDAS

In [300]:
import pandas as pd
import datetime

In [305]:
# create alist containing dates from 12-01 to 12-12
dt = datetime.datetime(2017,12,1)
end = datetime.datetime(2017,12,12)
step = datetime.timedelta(days=1)
dates =[]

In [306]:
# populate the list
while dt < end:
    dates.append(dt.strftime("%m-%d"))
    dt += step

In [307]:
dates

['12-01',
 '12-02',
 '12-03',
 '12-04',
 '12-05',
 '12-06',
 '12-07',
 '12-08',
 '12-09',
 '12-10',
 '12-11']

In [313]:
d= {'Date':dates, 'Tokyo':[15,19,15,11,9,8,13,15,19,15,11], 'Paris': [-2,0,2,5,7,-5,-3,-2,0,5,7], 'Mumbai': [20,18,23,19,25,27,23,20,18,23,19]}

In [314]:
print d

{'Date': ['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07', '12-08', '12-09', '12-10', '12-11'], 'Paris': [-2, 0, 2, 5, 7, -5, -3, -2, 0, 5, 7], 'Mumbai': [20, 18, 23, 19, 25, 27, 23, 20, 18, 23, 19], 'Tokyo': [15, 19, 15, 11, 9, 8, 13, 15, 19, 15, 11]}

create dataframe object from a python dictionary of equal lenght lists

In [315]:
temps = pd.DataFrame (d)
print (temps)

     Date  Mumbai  Paris  Tokyo
0   12-01      20     -2     15
1   12-02      18      0     19
2   12-03      23      2     15
3   12-04      19      5     11
4   12-05      25      7      9
5   12-06      27     -5      8
6   12-07      23     -3     13
7   12-08      20     -2     15
8   12-09      18      0     19
9   12-10      23      5     15
10  12-11      19      7     11

In [318]:
ntemp = temps ["Mumbai"]

In [319]:
print ntemp

0     20
1     18
2     23
3     19
4     25
5     27
6     23
7     20
8     18
9     23
10    19
Name: Mumbai, dtype: int64

In [322]:
temps = temps.set_index('Date')

In [321]:
temps

     Date  Mumbai  Paris  Tokyo
0   12-01      20     -2     15
1   12-02      18      0     19
2   12-03      23      2     15
3   12-04      19      5     11
4   12-05      25      7      9
5   12-06      27     -5      8
6   12-07      23     -3     13
7   12-08      20     -2     15
8   12-09      18      0     19
9   12-10      23      5     15
10  12-11      19      7     11

create DataFrame object by reading a .csv file (Titanic Passengers)

In [327]:
titanic = pd.read_csv("../Documents/titanic.csv")
print titanic

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
12                      Saundercock, Mr. William Henry    male  20.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                                Rice, Master. Eugene    male   2.0      4
17                        Williams, Mr. Charles Eugene    male   NaN      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
20                                Fynney, Mr. Joseph J    male  35.0      0
21                               Beesley, Mr. Lawrence    male  34.0      0
22                         McGowan, Miss. Anna "Annie"  female  15.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
24                       Palsson, Miss. Torborg Danira  female   8.0      3
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
26                             Emir, Mr. Farred Chehab    male   NaN      0
27                      Fortune, Mr. Charles Alexander    male  19.0      3
28                       O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
29                                 Todoroff, Mr. Lalio    male   NaN      0
..                                                 ...     ...   ...    ...
861                        Giles, Mr. Frederick Edward    male  21.0      1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
864                             Gill, Mr. John William    male  24.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
867               Roebling, Mr. Washington Augustus II    male  31.0      0
868                        van Melkebeke, Mr. Philemon    male   NaN      0
869                    Johnson, Master. Harold Theodor    male   4.0      1
870                                  Balkic, Mr. Cerin    male  26.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
876                      Gustafsson, Mr. Alfred Ossian    male  20.0      0
877                               Petroff, Mr. Nedelio    male  19.0      0
878                                 Laleff, Mr. Kristo    male   NaN      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket      Fare        Cabin Embarked
0        0         A/5 21171    7.2500          NaN        S
1        0          PC 17599   71.2833          C85        C
2        0  STON/O2. 3101282    7.9250          NaN        S
3        0            113803   53.1000         C123        S
4        0            373450    8.0500          NaN        S
5        0            330877    8.4583          NaN        Q
6        0             17463   51.8625          E46        S
7        1            349909   21.0750          NaN        S
8        2            347742   11.1333          NaN        S
9        0            237736   30.0708          NaN        C
10       1           PP 9549   16.7000           G6        S
11       0            113783   26.5500         C103        S
12       0         A/5. 2151    8.0500          NaN        S
13       5            347082   31.2750          NaN        S
14       0            350406    7.8542          NaN        S
15       0            248706   16.0000          NaN        S
16       1            382652   29.1250          NaN        Q
17       0            244373   13.0000          NaN        S
18       0            345763   18.0000          NaN        S
19       0              2649    7.2250          NaN        C
20       0            239865   26.0000          NaN        S
21       0            248698   13.0000          D56        S
22       0            330923    8.0292          NaN        Q
23       0            113788   35.5000           A6        S
24       1            349909   21.0750          NaN        S
25       5            347077   31.3875          NaN        S
26       0              2631    7.2250          NaN        C
27       2             19950  263.0000  C23 C25 C27        S
28       0            330959    7.8792          NaN        Q
29       0            349216    7.8958          NaN        S
..     ...               ...       ...          ...      ...
861      0             28134   11.5000          NaN        S
862      0             17466   25.9292          D17        S
863      2          CA. 2343   69.5500          NaN        S
864      0            233866   13.0000          NaN        S
865      0            236852   13.0000          NaN        S
866      0     SC/PARIS 2149   13.8583          NaN        C
867      0          PC 17590   50.4958          A24        S
868      0            345777    9.5000          NaN        S
869      1            347742   11.1333          NaN        S
870      0            349248    7.8958          NaN        S
871      1             11751   52.5542          D35        S
872      0               695    5.0000  B51 B53 B55        S
873      0            345765    9.0000          NaN        S
874      0         P/PP 3381   24.0000          NaN        C
875      0              2667    7.2250          NaN        C
876      0              7534    9.8458          NaN        S
877      0            349212    7.8958          NaN        S
878      0            349217    7.8958          NaN        S
879      1             11767   83.1583          C50        C
880      1            230433   26.0000          NaN        S
881      0            349257    7.8958          NaN        S
882      0              7552   10.5167          NaN        S
883      0  C.A./SOTON 34068   10.5000          NaN        S
884      0   SOTON/OQ 392076    7.0500          NaN        S
885      5            382652   29.1250          NaN        Q
886      0            211536   13.0000          NaN        S
887      0            112053   30.0000          B42        S
888      2        W./C. 6607   23.4500          NaN        S
889      0            111369   30.0000         C148        C
890      0            370376    7.7500          NaN        Q

[891 rows x 12 columns]

In [328]:
print titanic.Fare.value_counts()

8.0500      43
13.0000     42
7.8958      38
7.7500      34
26.0000     31
10.5000     24
7.9250      18
7.7750      16
26.5500     15
0.0000      15
7.2292      15
7.8542      13
8.6625      13
7.2500      13
7.2250      12
16.1000      9
9.5000       9
24.1500      8
15.5000      8
56.4958      7
52.0000      7
14.5000      7
14.4542      7
69.5500      7
7.0500       7
31.2750      7
46.9000      6
30.0000      6
7.7958       6
39.6875      6
            ..
7.1417       1
42.4000      1
211.5000     1
12.2750      1
61.1750      1
8.4333       1
51.4792      1
7.8875       1
8.6833       1
7.5208       1
34.6542      1
28.7125      1
25.5875      1
7.7292       1
12.2875      1
8.6542       1
8.7125       1
61.3792      1
6.9500       1
9.8417       1
8.3000       1
13.7917      1
9.4750       1
13.4167      1
26.3875      1
8.4583       1
9.8375       1
8.3625       1
14.1083      1
17.4000      1
Name: Fare, Length: 248, dtype: int64

create DataFrame object by reading a .csv file (Olympic Medalists)

In [329]:
medals=pd.read_csv('../Documents/olympicmedals.csv')

In [330]:
medals.tail()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
29211,Beijing,2008,Wrestling,Wrestling Gre-R,"ENGLICH, Mirko",GER,Men,84 - 96kg,M,Silver
29212,Beijing,2008,Wrestling,Wrestling Gre-R,"MIZGAITIS, Mindaugas",LTU,Men,96 - 120kg,M,Bronze
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

In [332]:
medals.Sport.value_counts ()

Aquatics             3828
Athletics            3448
Rowing               2523
Gymnastics           2214
Fencing              1547
Football             1387
Hockey               1325
Wrestling            1140
Shooting             1105
Sailing              1061
Cycling              1025
Canoe / Kayak        1002
Basketball            940
Volleyball            910
Equestrian            894
Handball              886
Boxing                842
Weightlifting         548
Judo                  435
Baseball              335
Archery               305
Tennis                272
Rugby                 192
Softball              180
Modern Pentathlon     174
Badminton             120
Table Tennis          120
Tug of War             94
Taekwondo              80
Polo                   66
Lacrosse               59
Golf                   30
Skating                27
Ice Hockey             27
Cricket                24
Triathlon              18
Rackets                10
Croquet                 8
Water Motorsports       5
Basque Pelota           4
Roque                   3
Jeu de paume            3
Name: Sport, dtype: int64

Getting started with pandas

In [333]:
import pandas as pd
pd.Series

pandas.core.series.Series

In [334]:
from pandas import Series, DataFrame

In [335]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure',figsize=(10,6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

Introduction to pandas Data Structures

Series

In [336]:
obj = pd.Series ([8, 9, -3, 5])
obj

0    8
1    9
2   -3
3    5
dtype: int64

In [337]:
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [338]:
obj2=pd.Series([8,9,-3,5], index = ['d', 'b','a','c'])
obj2
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [339]:
obj2 ['a']
obj2 ['d'] = 6
obj2[['c', 'a', 'd']]

c    5
a   -3
d    6
dtype: int64

In [340]:
obj2[obj2 > 0]
obj2 * 2
np.exp (obj2)

d     403.428793
b    8103.083928
a       0.049787
c     148.413159
dtype: float64

In [341]:
'b' in obj2
'f' in obj2
'e' in obj2

False

In [342]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [344]:
states = ['California', 'Texas', 'LosAngeles', 'Oregon', 'Ohio']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Texas         71000.0
LosAngeles        NaN
Oregon        16000.0
Ohio          35000.0
dtype: float64

In [345]:
pd.isnull(obj4)
pd.notnull(obj4)

California    False
Texas          True
LosAngeles    False
Oregon         True
Ohio           True
dtype: bool

In [346]:
obj4.isnull()

California     True
Texas         False
LosAngeles     True
Oregon        False
Ohio          False
dtype: bool

In [347]:
obj3
obj4
obj3 + obj4

California         NaN
LosAngeles         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [348]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Texas         71000.0
LosAngeles        NaN
Oregon        16000.0
Ohio          35000.0
Name: population, dtype: float64

In [349]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      8
Steve    9
Jeff    -3
Ryan     5
dtype: int64

DataFrame

In [352]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [353]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [354]:
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [355]:
pd.DataFrame(data,columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [359]:
frame2 = pd.DataFrame(data, columns=['year','state', 'pop', 'debt'],
                        index = ['one', 'two', 'three', 'four', 'five', 'six'])
    
frame2
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [360]:
frame2['state']
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [361]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [363]:
frame2['debt'] = 16.5
frame2
frame2['debt']= np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [364]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [365]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [366]:
del frame2['eastern']
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [369]:
pop = {'Nevada':{2001:2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [370]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [371]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [372]:
pd.DataFrame(pop, index = [2001, 2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [373]:
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [374]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [375]:
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, -1.2],
       [2002L, 'Ohio', 3.6, nan],
       [2001L, 'Nevada', 2.4, -1.5],
       [2002L, 'Nevada', 2.9, -1.7],
       [2003L, 'Nevada', 3.2, nan]], dtype=object)

Index Objects

In [376]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index
index[1:]

Index([u'b', u'c'], dtype='object')

In [377]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels

True

In [378]:
frame3
frame3.columns
'Ohio' in frame3.columns
2003 in frame3.index

False

In [379]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index([u'foo', u'foo', u'bar', u'bar'], dtype='object')

Essential Functionality

Reindexing

In [380]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [381]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [382]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index= [0, 2, 4]) 
obj3
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [383]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index = ['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [384]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [385]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

Dropping Entries from an Axis

In [386]:
Obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj
new_obj = obj.drop('c')
new_obj
obj.drop(['d', 'c'])

b    7.2
a   -5.3
dtype: float64

In [391]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index= ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [393]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [394]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [395]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [396]:
obj.drop('c', inplace=True)
obj

d    4.5
b    7.2
a   -5.3
dtype: float64